garyPenhook/PyAvrOCD/svd/avr64du32.svd
        <register>
          <name>CHANNEL2</name>
          <description>Multiplexer Channel 2</description>
          <addressOffset>0x12</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI_SYNCH</name>
                  <description>UPDI SYNCH Character</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter Overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter Compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_EVGEN0</name>
                  <description>Real Time Counter Event Output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_EVGEN1</name>
                  <description>Real Time Counter Event Output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 Out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RESRDY</name>
                  <description>ADC0 Result Ready</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_SAMPRDY</name>
                  <description>ADC0 Sample Ready</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_WCMP</name>
                  <description>ADC0 Window Comparator</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EVGEN0</name>
                  <description>Port A Event 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EVGEN1</name>
                  <description>Port A Event 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EVGEN0</name>
                  <description>Port C Event 0</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EVGEN1</name>
                  <description>Port C Event 1</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EVGEN0</name>
                  <description>Port D Event 0</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EVGEN1</name>
                  <description>Port D Event 1</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EVGEN0</name>
                  <description>Port F Event 0</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EVGEN1</name>
                  <description>Port F Event 1</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 SCK</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 Overflow / Low Byte Timer Underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 High Byte Timer Underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 Compare 0 / Low Byte Compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 Compare 1 / Low Byte Compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 Compare 2 / Low Byte Compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 Capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 Overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 Capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 Overflow</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_SETUP</name>
                  <description>USB0 Setup Received</description>
                  <value>192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_SOF</name>
                  <description>USB0 SOF Received</description>
                  <value>193</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_CRC</name>
                  <description>USB0 CRC Error</description>
                  <value>194</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_UNFOVF</name>
                  <description>USB0 Underflow / Overflow</description>
                  <value>195</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_RX</name>
                  <description>USB0 Data Byte Received</description>
                  <value>196</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_TX</name>
                  <description>USB0 Data Byte Transmitted</description>
                  <value>197</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANNEL3</name>
          <description>Multiplexer Channel 3</description>
          <addressOffset>0x13</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHANNEL</name>
              <description>Channel generator select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDI_SYNCH</name>
                  <description>UPDI SYNCH Character</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_OVF</name>
                  <description>Real Time Counter Overflow</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_CMP</name>
                  <description>Real Time Counter Compare</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_EVGEN0</name>
                  <description>Real Time Counter Event Output 0</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_EVGEN1</name>
                  <description>Real Time Counter Event Output 1</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT0</name>
                  <description>Configurable Custom Logic LUT0</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT1</name>
                  <description>Configurable Custom Logic LUT1</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT2</name>
                  <description>Configurable Custom Logic LUT2</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCL_LUT3</name>
                  <description>Configurable Custom Logic LUT3</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0_OUT</name>
                  <description>Analog Comparator 0 Out</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_RESRDY</name>
                  <description>ADC0 Result Ready</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_SAMPRDY</name>
                  <description>ADC0 Sample Ready</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC0_WCMP</name>
                  <description>ADC0 Window Comparator</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EVGEN0</name>
                  <description>Port A Event 0</description>
                  <value>64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA_EVGEN1</name>
                  <description>Port A Event 1</description>
                  <value>65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EVGEN0</name>
                  <description>Port C Event 0</description>
                  <value>68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC_EVGEN1</name>
                  <description>Port C Event 1</description>
                  <value>69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EVGEN0</name>
                  <description>Port D Event 0</description>
                  <value>70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD_EVGEN1</name>
                  <description>Port D Event 1</description>
                  <value>71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EVGEN0</name>
                  <description>Port F Event 0</description>
                  <value>74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTF_EVGEN1</name>
                  <description>Port F Event 1</description>
                  <value>75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0_XCK</name>
                  <description>USART 0 XCK</description>
                  <value>96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1_XCK</name>
                  <description>USART 1 XCK</description>
                  <value>97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0_SCK</name>
                  <description>SPI 0 SCK</description>
                  <value>104</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_OVF_LUNF</name>
                  <description>Timer/Counter A0 Overflow / Low Byte Timer Underflow</description>
                  <value>128</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_HUNF</name>
                  <description>Timer/Counter A0 High Byte Timer Underflow</description>
                  <value>129</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP0_LCMP0</name>
                  <description>Timer/Counter A0 Compare 0 / Low Byte Compare 0</description>
                  <value>132</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP1_LCMP1</name>
                  <description>Timer/Counter A0 Compare 1 / Low Byte Compare 1</description>
                  <value>133</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0_CMP2_LCMP2</name>
                  <description>Timer/Counter A0 Compare 2 / Low Byte Compare 2</description>
                  <value>134</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_CAPT</name>
                  <description>Timer/Counter B0 Capture</description>
                  <value>160</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0_OVF</name>
                  <description>Timer/Counter B0 Overflow</description>
                  <value>161</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_CAPT</name>
                  <description>Timer/Counter B1 Capture</description>
                  <value>162</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1_OVF</name>
                  <description>Timer/Counter B1 Overflow</description>
                  <value>163</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_SETUP</name>
                  <description>USB0 Setup Received</description>
                  <value>192</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_SOF</name>
                  <description>USB0 SOF Received</description>
                  <value>193</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_CRC</name>
                  <description>USB0 CRC Error</description>
                  <value>194</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_UNFOVF</name>
                  <description>USB0 Underflow / Overflow</description>
                  <value>195</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_RX</name>
                  <description>USB0 Data Byte Received</description>
                  <value>196</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USB0_TX</name>
                  <description>USB0 Data Byte Transmitted</description>
                  <value>197</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
